app/Helpers/app_helper.php

  function auth(string $requiredRole)
  {
      $userId = session()->get('user_id');
      // Load the UserModel (make sure to include the model if needed)
      $userModel = new \App\Models\UserModel();

      // Fetch the user's role from the database
      $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'

    function is_location()
    {
      $userId = session()->get('user_id');
      $userModel = new UserModel();
      $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'

  function getMy(string $string)
  {
      $userId = session()->get('user_id');
      $userModel = new \App\Models\UserModel();

      $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'