app/Controllers/Auth.php

public function index()
{
    if(session()->get('logged_in'))
    {
        return redirect()->to('home');
    }

    if ($this->request->getMethod() == 'post' || $this->request->getMethod() == 'POST')
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $remember = 1;

        $user = $this->UserModel->where('email', $email)->first();

        if ($user && password_verify($password, $user['password']))
        {
            // Set session data
            session()->set([
                'logged_in' => true,
                'user_id' => $user['id']
            ]);

            // Only set remember token if "Remember Me" was checked
            if ($remember)
            {
                $token = bin2hex(random_bytes(32));
                $expires = date('Y-m-d H:i:s', time() + (30 * 24 * 60 * 60)); // 30 days

                // Save to database
                $this->UserModel->update($user['id'], [
                    'remember_token' => $token,
                    'remember_expires' => $expires
                ]);
---
SELECT *
FROM `users`
WHERE `email` = 'admin@tawseelonline.om'
 LIMIT 1
UPDATE `users` SET `remember_token` = '5ea6ff425f6fdead2de0586fcdbc2b5a637ef4810ce12437390c587fb61234f7', `remember_expires` = '2025-08-21 11:42:00', `updated_at` = '2025-07-22 11:42:00'
WHERE `users`.`id` IN ('2')

    public function updatefield()
    {
        if(!auth('admin'))
        {
            return view('nallowed');
        }

        $id = $this->request->getPost('id');
        $field = $this->request->getPost('field');
        $value = $this->request->getPost('value');
        $value = str_replace(["\r\n", "\n\r", "\r"], "\n", $value);

        $this->AgreementTempModel->update($id, [$field => $value]);
---
UPDATE `agreement_temp` SET `confidentiality` = '[COMPANY NAME] agrees to abide by the provisions outlined in any separately agreed confidentiality agreement between them. If no such separate agreement exists, they agree to abide by the following. As part of the business relationship between [COMPANY NAME] and the Logistics Service Provider, the Logistics Service Provider may be in, or come into, possession of information or data which is not available to the public and which constitute trade secrets, know-how, and confidential information or are otherwise considered secret by [COMPANY NAME] (hereinafter “Information”). \n\nIn consideration of the receipt of such Information and the benefits it receives under this Agreement, the Logistics Service Provider agrees to maintain such Information in the utmost of confidence; to use such Information solely in connection with the business relationship created by this Agreement; and to take all measures necessary to protect such Information from disclosure.', `updated_at` = '2025-07-25 14:23:32'
WHERE `agreement_temp`.`id` IN ('91')