app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Auto-login with remember token
        if (!session()->get('logged_in') && isset($_COOKIE['remember_token']))
        {
            $model = new UserModel();
            $token = $_COOKIE['remember_token'];

            $user = $model->where('remember_token', $token)
                        ->where('remember_expires >', date('Y-m-d H:i:s'))
                        ->first();

            if ($user)
            {
                session()->set([
                    'logged_in' => true,
                    'user_id' => $user['id'],
                    'full_name' => $user['fullname'],
                    'email' => $user['email'],
                    'phone' => $user['phone']
                ]);

                // Optional: Refresh the token
                $newToken = bin2hex(random_bytes(32));
                $model->update($user['id'], [
                    'remember_token' => $newToken,
                    'remember_expires' => date('Y-m-d H:i:s', time() + (30 * 24 * 60 * 60))
                ]);
---
SELECT *
FROM `users`
WHERE `remember_token` = 'cbdcbd79953fd7b662929c1a53086f179fc1b1be225ce5cdfb7523b48a4fe693'
AND `remember_expires` > '2025-07-22 17:44:44'
 LIMIT 1
UPDATE `users` SET `remember_token` = '755cfe41e6095902085854ba428055c066780f9716342a22f32e12ccc2f6e477', `remember_expires` = '2025-08-21 17:44:44', `updated_at` = '2025-07-22 17:44:44'
WHERE `users`.`id` IN ('2')