app/Controllers/Dashboard.php

SELECT `type`, COUNT(*) as count
FROM `users`
WHERE `type` IN ("personal", "eCommerce", "logistics")
GROUP BY `type`
SELECT `sub_type`, COUNT(*) as count
FROM `users`
WHERE `sub_type` IN ("b2b", "b2c", "c2c", "1pl", "2pl", "34pl")
GROUP BY `sub_type`
ORDER BY `sub_type`
SELECT DATE_FORMAT(created_at, '%M') as month, COUNT(*) as count
FROM `users`
WHERE YEAR(created_at) = '2025'
GROUP BY DATE_FORMAT(created_at, '%M'), MONTH(created_at)
ORDER BY MONTH(created_at)
---
    public function index()
    {
        if(login())
        {
            // Users by type
            $users = $this->userModel->select('type, COUNT(*) as count')
                        ->groupBy('type')
                        ->where('type IN ("personal", "eCommerce", "logistics")')
                        ->get()
                        ->getResultArray();

            // Users by sub-type
            $users_sub = $this->userModel->select('sub_type, COUNT(*) as count')
                        ->groupBy('sub_type')
                        ->where('sub_type IN ("b2b", "b2c", "c2c", "1pl", "2pl", "34pl")')
                        ->orderBy('sub_type')
                        ->get()
                        ->getResultArray();

            // Monthly registrations (fixed query)
            $currentYear = date('Y');
            $users_reg = $this->userModel->select("DATE_FORMAT(created_at, '%M') as month, COUNT(*) as count")
            ->where('YEAR(created_at)', $currentYear)
            ->groupBy(["DATE_FORMAT(created_at, '%M')", "MONTH(created_at)"])
            ->orderBy("MONTH(created_at)")
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `users`
---
        }

        // Get total count for pagination
        $totalItems = $userModel->countAllResults(false);

SELECT *
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 20
---
        $totalPages = ceil($totalItems / $perPage);
        // Get paginated results
        $offset = ($currentPage - 1) * $perPage;
        $data['users'] = $userModel->orderBy('created_at', 'DESC')->findAll($perPage, $offset);

SELECT *
FROM `agreement_temp`
ORDER BY `id` DESC
---
    public function agreement_temp()
    {
        $records = $this->AgreementTempModel->orderBy('id', 'DESC')->find();

SELECT *
FROM `agreement_temp`
WHERE `agreement_temp`.`id` = '91'
---
    public function agreement_view($id)
    {
        $id = dec($id);
        $record = $this->AgreementTempModel->find($id);