app/Controllers/Home.php

    public function index(): string {
        $siteInfo = $this->siteInfoModel->first();
        $result = $this->HomeInfoModel->get();
        $homeInfos = $result->getResultArray();
        $highLights = $this->KeyHighlightModel->first();
        $result = $this->HighlightItemModel->get();
        $highlightItems = $result->getResultArray();
        $legalInfo    = $this->MenuModel->where('title_en', 'Legal Information')->first();
        $services     = $this->MenuModel->where('title_en', 'Services')->first();
        $links        = $this->MenuModel->where('title_en', 'Links')->first();
        $data['legalItems']  = $legalInfo ?
        $this->MenuItemModel->where('menu_id', $legalInfo['id'])->orderBy('order', 'asc')->findAll() : [];
        $data['serviceItems'] = $services ?
        $this->MenuItemModel->where('menu_id', $services['id'])->orderBy('order', 'asc')->findAll() : [];
        $data['linkItems']   = $links ?
        $this->MenuItemModel->where('menu_id', $links['id'])->orderBy('order', 'asc')->findAll() : [];
---
SELECT *
FROM `site_info`
 LIMIT 1
SELECT *
FROM `homeinfo`
SELECT *
FROM `key_highlight`
 LIMIT 1
SELECT *
FROM `key_highlight_items`
SELECT *
FROM `menus`
WHERE `title_en` = 'Legal Information'
 LIMIT 1
SELECT *
FROM `menus`
WHERE `title_en` = 'Services'
 LIMIT 1
SELECT *
FROM `menus`
WHERE `title_en` = 'Links'
 LIMIT 1
SELECT *
FROM `menu_items`
WHERE `menu_id` = '8'
ORDER BY `order` ASC
SELECT *
FROM `menu_items`
WHERE `menu_id` = '9'
ORDER BY `order` ASC
SELECT *
FROM `menu_items`
WHERE `menu_id` = '10'
ORDER BY `order` ASC