app/Controllers/Partnership.php

SELECT *
FROM `partnership`
 LIMIT 1
---
    public function index(){
        $partnerships = $this->PartnershipModel->first();