app/Controllers/PartnerItem.php

SELECT *
FROM `partnership`
---
    public function edit($id) {
        $id = dec($id);
        $data = [
            'item' => $this->model->find($id),
            'partnerships' => $this->partnershipModel->findAll()